Show / Hide Table of Contents
Class TendonComponentLoading
Tendon component loading
Inheritance
System.Object
TendonComponentLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class TendonComponentLoading
Properties
Improve this Doc   View Source
Id
Tendon component Id
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Loading
Loading
Declaration
public TendonLoading Loading { get; set; }
Property Value
 Type |  Description
 TendonLoading
 Improve this Doc
 View Source